<p style="font-family: Arial; font-size:3.75em;color:purple; font-style:bold"><br>
Pandas</p><br>

In [1]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

<p style="font-family: Arial; font-size:1.75em;color:#2462C0; font-style:bold"><br>

Import Libraries
</p>

In [2]:
import pandas as pd
import numpy as np

<p style="font-family: Arial; font-size:1.75em;color:#2462C0; font-style:bold">
Introduction to pandas Data Structures</p>
<br>
*pandas* has two main data structures it uses, namely, *Series* and *DataFrames*. 

<p style="font-family: Arial; font-size:1.75em;color:#2462C0; font-style:bold">
pandas Series</p>

*pandas Series* one-dimensional labeled array.

In [3]:
#Series is one-dimensional array of indexed data. The index can be explicitly defined: pd.Series(data, index = index)
ser1=pd.Series([0.25,0.5,0.75,1])
ser1
ser = pd.Series([100, 'foo', 300, 'bar', 500], ['tom', 'bob', 'nancy', 'dan', 'eric'])
ser
ser2 = pd.Series([0.25,0.5,0.75,1.0],
                 index = ['a','b','c','d'])
ser2

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

tom      100
bob      foo
nancy    300
dan      bar
eric     500
dtype: object

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [4]:
#Get the values
ser.index
ser.values
ser1.index

Index(['tom', 'bob', 'nancy', 'dan', 'eric'], dtype='object')

array([100, 'foo', 300, 'bar', 500], dtype=object)

RangeIndex(start=0, stop=4, step=1)

In [5]:
#You may construct a series from python dictionary.
population_dict={'California':38332521,
                'Texas':26448193,
                'New York':19651127,
                'Florida':19552860,
                'Illinois':12882135}
population=pd.Series(population_dict)
population
#The difference is that series has specified types for both data and index

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [6]:
#To access elements of series
ser
ser[['nancy','bob']]
ser[[4, 3, 1]]

tom      100
bob      foo
nancy    300
dan      bar
eric     500
dtype: object

nancy    300
bob      foo
dtype: object

eric    500
dan     bar
bob     foo
dtype: object

In [7]:
#To avoid confusion. We use loc[] or iloc[] to access.

# loc: explicit index; iloc: implicit Python-style index
ser.loc[['nancy','bob']]
ser.iloc[1]

nancy    300
bob      foo
dtype: object

'foo'

In [8]:
#Check whether items in series
'bob' in ser

True

In [9]:
#Operations on series
ser * 2
ser[['nancy', 'eric']] ** 2

tom         200
bob      foofoo
nancy       600
dan      barbar
eric       1000
dtype: object

nancy     90000
eric     250000
dtype: object

<p style="font-family: Arial; font-size:1.75em;color:#2462C0; font-style:bold">
pandas DataFrame</p>

*pandas DataFrame* is a 2-dimensional labeled data structure.

<p style="font-family: Arial; font-size:1.25em;color:#2462C0; font-style:bold">
Create DataFrames</p>

In [10]:
# from a single Series object

pd.DataFrame(population, columns = ['population'])

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135

In [11]:
# from a list of dicts

d = [{'a':1, 'b':2}, {'b': 3, 'c': 4}]
pd.DataFrame(d)
pd.DataFrame(d, index=['orange', 'red'])
pd.DataFrame(d, columns=['joe', 'dora','alice'])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

          a  b    c
orange  1.0  2  NaN
red     NaN  3  4.0

   joe  dora  alice
0  NaN   NaN    NaN
1  NaN   NaN    NaN

In [12]:
# from a dictionary of Series objects

area_dict={'California':423967,
                'Texas':695662,
                'New York':141297,
                'Florida':170312,
                'Illinois':12882135}
area=pd.Series(area_dict)
area

states=pd.DataFrame({'population' : population,
                   'area': area})
states

California      423967
Texas           695662
New York        141297
Florida         170312
Illinois      12882135
dtype: int64

            population      area
California    38332521    423967
Texas         26448193    695662
New York      19651127    141297
Florida       19552860    170312
Illinois      12882135  12882135

In [13]:
states.index
states.columns

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

Index(['population', 'area'], dtype='object')

In [14]:
# Create DataFrame from a 2-dimensional np arrays

pd.DataFrame(np.random.rand(3,2),
            columns=['foo','bar'],
            index=['a','b','c'])

        foo       bar
a  0.871359  0.454881
b  0.839151  0.677997
c  0.492150  0.522730

<p style="font-family: Arial; font-size:1.25em;color:#2462C0; font-style:bold">
Indexing</p>

In [15]:
states['area']

California      423967
Texas           695662
New York        141297
Florida         170312
Illinois      12882135
Name: area, dtype: int64

In [16]:
states.area

California      423967
Texas           695662
New York        141297
Florida         170312
Illinois      12882135
Name: area, dtype: int64

In [17]:
states['density'] = states['population'] / states['area']
states

            population      area     density
California    38332521    423967   90.413926
Texas         26448193    695662   38.018740
New York      19651127    141297  139.076746
Florida       19552860    170312  114.806121
Illinois      12882135  12882135    1.000000

In [18]:
# examine the raw underlying data array
states.values

array([[3.83325210e+07, 4.23967000e+05, 9.04139261e+01],
       [2.64481930e+07, 6.95662000e+05, 3.80187404e+01],
       [1.96511270e+07, 1.41297000e+05, 1.39076746e+02],
       [1.95528600e+07, 1.70312000e+05, 1.14806121e+02],
       [1.28821350e+07, 1.28821350e+07, 1.00000000e+00]])

In [19]:
states.T

              California         Texas      New York       Florida    Illinois
population  3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  12882135.0
area        4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  12882135.0
density     9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02         1.0

In [20]:
states.values[0]

array([3.83325210e+07, 4.23967000e+05, 9.04139261e+01])

In [21]:
states.iloc[:3,:2]
states.loc[:'Illinois', :'area']

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297

            population      area
California    38332521    423967
Texas         26448193    695662
New York      19651127    141297
Florida       19552860    170312
Illinois      12882135  12882135

In [22]:
states.loc[states.density > 100, ['population', 'density']]

          population     density
New York    19651127  139.076746
Florida     19552860  114.806121

In [23]:
states.iloc[0,2] = 90
states

            population      area     density
California    38332521    423967   90.000000
Texas         26448193    695662   38.018740
New York      19651127    141297  139.076746
Florida       19552860    170312  114.806121
Illinois      12882135  12882135    1.000000

In [24]:
states['Florida':'Illinois']
states[1:3]
states[states.density > 100]

          population      area     density
Florida     19552860    170312  114.806121
Illinois    12882135  12882135    1.000000

          population    area     density
Texas       26448193  695662   38.018740
New York    19651127  141297  139.076746

          population    area     density
New York    19651127  141297  139.076746
Florida     19552860  170312  114.806121

<p style="font-family: Arial; font-size:1.25em;color:#2462C0; font-style:bold">
Basic DataFrame operations</p>

In [25]:
d = {'one' : pd.Series([100., 200., 300.], index=['apple', 'ball', 'clock']),
     'two' : pd.Series([111., 222., 333., 4444.], index=['apple', 'ball', 'cerill', 'dancy'])}
df = pd.DataFrame(d)
df

          one     two
apple   100.0   111.0
ball    200.0   222.0
cerill    NaN   333.0
clock   300.0     NaN
dancy     NaN  4444.0

In [26]:
#To access rows and columns
df['one']
df.values[0]

apple     100.0
ball      200.0
cerill      NaN
clock     300.0
dancy       NaN
Name: one, dtype: float64

array([100., 111.])

In [27]:
#Create new variables
df['three'] = df['one'] * df['two']
df
three = df.pop('three')
three

          one     two    three
apple   100.0   111.0  11100.0
ball    200.0   222.0  44400.0
cerill    NaN   333.0      NaN
clock   300.0     NaN      NaN
dancy     NaN  4444.0      NaN

apple     11100.0
ball      44400.0
cerill        NaN
clock         NaN
dancy         NaN
Name: three, dtype: float64

In [28]:
df['flag'] = df['one'] > 250
df

          one     two   flag
apple   100.0   111.0  False
ball    200.0   222.0  False
cerill    NaN   333.0  False
clock   300.0     NaN   True
dancy     NaN  4444.0  False

In [29]:
del df['two']
df

          one   flag
apple   100.0  False
ball    200.0  False
cerill    NaN  False
clock   300.0   True
dancy     NaN  False

In [30]:
df.insert(2, 'copy_of_one', df['one'])
df

          one   flag  copy_of_one
apple   100.0  False        100.0
ball    200.0  False        200.0
cerill    NaN  False          NaN
clock   300.0   True        300.0
dancy     NaN  False          NaN

<p style="font-family: Arial; font-size:1.5em;color:#2462C0; font-style:bold">
Missing Data</p>

In [31]:
data = pd.Series([1, np.nan, 'hello', None])
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [32]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [33]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [34]:
data.dropna()

0        1
2    hello
dtype: object

In [35]:
# Deleting null values
df = pd.DataFrame([[1,      np.nan, 2],
                 [2,      3,      5],
                 [np.nan, 4,    6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [36]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [37]:
df.dropna(axis = 'columns')

   2
0  2
1  5
2  6

In [38]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [39]:
df.dropna(axis = 'columns', how = 'all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [40]:
df.dropna(axis = 'rows', thresh = 3)

     0    1  2   3
1  2.0  3.0  5 NaN

In [41]:
# Filling null values
data = pd.Series([1, np.nan, 2, None, 3], index = list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [42]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [43]:
# forward-fill
data.fillna(method = 'ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [44]:
# back-fill
data.fillna(method = 'bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [45]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [46]:
df.fillna(method = 'ffill', axis = 1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

<p style="font-family: Arial; font-size:1.5em;color:#2462C0; font-style:bold">
Hierarchical Indexing</p>

In [47]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956, 
              18976457, 19378102,
              20851820, 25145561]

pop = pd.Series(populations, index = index)
pop # bad way

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [48]:
# the better way: Pandas MultiIndex

index = pd.MultiIndex.from_tuples(index)
index

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [49]:
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [50]:
pop[:, 2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [51]:
pop.index.names = ['state', 'year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [52]:
# Explicit MultiIndex constructors

pd.MultiIndex.from_arrays([['a','a','b','b'], [1,2,1,2]])
pd.MultiIndex.from_tuples([('a',1), ('a',2), ('b',1), ('b',2)])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [53]:
# construct the index from a Cartesian product of single indices
pd.MultiIndex.from_product([['a','b'],[1,2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [54]:
# MultiIndex for columns

index = pd.MultiIndex.from_product([[2013,2014],[1,2]],
                                  names = ['year','visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Jane','Sue'], ['HR', 'Temp']],
                                    names = ['subject', 'type'])


data = np.round(np.random.randn(4,6),1)
data[:, ::2] *= 10
data += 37

health_data = pd.DataFrame(data, index = index, columns = columns)
health_data

subject      Bob        Jane         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      37.0  38.5  53.0  37.3  42.0  37.8
     2      33.0  35.6  55.0  36.9  41.0  34.9
2014 1      42.0  36.4  18.0  36.1  34.0  37.1
     2      52.0  35.2  49.0  36.3  37.0  37.1

In [55]:
health_data['Jane']

type          HR  Temp
year visit
2013 1      53.0  37.3
     2      55.0  36.9
2014 1      18.0  36.1
     2      49.0  36.3

In [56]:

health_data['Sue','HR']

year  visit
2013  1        42.0
      2        41.0
2014  1        34.0
      2        37.0
Name: (Sue, HR), dtype: float64

In [57]:
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      37.0  38.5
     2      33.0  35.6

In [58]:
health_data.loc[:, ('Bob', 'HR')]

year  visit
2013  1        37.0
      2        33.0
2014  1        42.0
      2        52.0
Name: (Bob, HR), dtype: float64

In [59]:
# Stacking and unstacking indices: convert a dataset from a stacked multi-index to a simple two-dimensional representation
pop.unstack(level = 0)
pop.unstack(level = 1)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [60]:
pop.unstack().stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [61]:
data_mean = health_data.mean(level = 'year')
data_mean

subject   Bob         Jane         Sue
type       HR   Temp    HR  Temp    HR   Temp
year
2013     35.0  37.05  54.0  37.1  41.5  36.35
2014     47.0  35.80  33.5  36.2  35.5  37.10

In [62]:
data_mean.mean(axis = 1, level = 'type')

type         HR       Temp
year
2013  43.500000  36.833333
2014  38.666667  36.366667

<p style="font-family: Arial; font-size:1.75em;color:#2462C0; font-style:bold">
Combining Datasets: Concat and Append</p>

In [63]:
def make_df(cols, ind):
    # quickly make a dataframe
    data = {c:[str(c) + str(i) for i in ind] for c in cols}
    return pd.DataFrame(data,ind)
make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [64]:
df1 = make_df('AB',[1,2])
df2 = make_df('AB',[3,4])
df1
df2
pd.concat([df1,df2])

    A   B
1  A1  B1
2  A2  B2

    A   B
3  A3  B3
4  A4  B4

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [65]:
x = make_df('AB',[0,1])
y = make_df('AB',[2,3])
y.index = x.index
x
y
pd.concat([x,y]) # duplicate indices

    A   B
0  A0  B0
1  A1  B1

    A   B
0  A2  B2
1  A3  B3

    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

In [66]:
pd.concat([x,y], ignore_index = True) # ignoring the index

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [67]:
pd.concat([x,y], keys = ['x', 'y']) # adding multiple keys

      A   B
x 0  A0  B0
  1  A1  B1
y 0  A2  B2
  1  A3  B3

### concatenation with joins

In [68]:
df3 = make_df('ABC',[1,2])
df4 = make_df('BCD', [3,4])
df3
df4

    A   B   C
1  A1  B1  C1
2  A2  B2  C2

    B   C   D
3  B3  C3  D3
4  B4  C4  D4

In [69]:
# by default, the entries for which no data is available are filled with NA values
pd.concat([df3,df4])

C:\Users\zhang\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

In [70]:
# by default, the join is a union of the input columns (join = 'outer')
# we can change this to an intersection of the columns 
pd.concat([df3,df4], join = 'inner')

    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

In [71]:
pd.concat([df3,df4], join_axes = [df3.columns])

     A   B   C
1   A1  B1  C1
2   A2  B2  C2
3  NaN  B3  C3
4  NaN  B4  C4

<p style="font-family: Arial; font-size:1.75em;color:#2462C0; font-style:bold">
Combining Datasets: Merge and Join</p>

In [72]:
# one-to-one joins

df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})

df1
df2
df3 = pd.merge(df1, df2)
df3

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [73]:
# many-to-one joins: one of the two key columns contains duplicate entries


df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})
df3
df4
pd.merge(df3, df4)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

In [74]:
# many-to-many joins: if the key column in both the left and right array contains duplicates

df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
                              'Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux',
                               'spreadsheets', 'organization']})

df1
df5
pd.merge(df1,df5)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

### Specification of the Merge Key

In [75]:
# The on keyword: explicitly specify the name of the key column
df1
df2
pd.merge(df1,df2, on = 'employee')

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [76]:
# left_on; right_on

df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})

df1
df3
pd.merge(df1,df3,left_on = 'employee', right_on = 'name')
pd.merge(df1,df3,left_on = 'employee', right_on = 'name').drop('name', axis = 1)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [77]:
# left_index, right_index
# Sometimes, rather than merging on a column, you would instead like to merge on an index.

df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
df1a
df2a

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [78]:
pd.merge(df1a,df2a,left_index = True, right_index = True)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [79]:
df1a.join(df2a)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [80]:
df1a
df3
pd.merge(df1a, df3, left_index = True, right_on = 'name')

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
2  Engineering  Lisa  120000
3           HR   Sue   90000

### When a value appears in one key column but not in other

In [81]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                    'food': ['fish', 'beans', 'bread']},
                   columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                   columns=['name', 'drink'])

df6
df7
# by default
pd.merge(df6,df7,how = 'inner')

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

     name drink
0    Mary  wine
1  Joseph  beer

   name   food drink
0  Mary  bread  wine

In [82]:
pd.merge(df6,df7, how = 'outer')

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [83]:
pd.merge(df6,df7, how = 'right')

     name   food drink
0    Mary  bread  wine
1  Joseph    NaN  beer

### Overlapping Column Names

In [84]:
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [1, 2, 3, 4]})
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [3, 1, 4, 2]})
df8
df9
pd.merge(df8,df9,on = 'name')

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [85]:
pd.merge(df8, df9, on = 'name', suffixes = ["_L", "_R"])

   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

<p style="font-family: Arial; font-size:1.75em;color:#2462C0; font-style:bold">
Aggregation and Grouping</p>

In [86]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data': range(6)}, columns=['key', 'data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [87]:
df.groupby('key')
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

In [88]:
# GroupBy objects have aggregate(), filter(), transform(), and apply() methods

rng = np.random.RandomState(0)
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data1': range(6),
                   'data2': rng.randint(0, 10, 6)},
                   columns = ['key', 'data1', 'data2'])
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [89]:
# aggregation
df.groupby('key').aggregate(['min',np.median,max])
df.groupby('key').aggregate({'data1': 'min',
                             'data2': 'max'})

    data1            data2
      min median max   min median max
key
A       0    1.5   3     3    4.0   5
B       1    2.5   4     0    3.5   7
C       2    3.5   5     3    6.0   9

     data1  data2
key
A        0      5
B        1      7
C        2      9

In [90]:
# filtering

# A filtering operation allows you to drop data based on the group properties. 
# For example, we might want to keep all groups in which the standard deviation is larger than some critical value:

def filter_func(x):
    return x['data2'].std() > 4

df
df.groupby('key').std()
df.groupby('key').filter(filter_func)

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

       data1     data2
key
A    2.12132  1.414214
B    2.12132  4.949747
C    2.12132  4.242641

  key  data1  data2
1   B      1      0
2   C      2      3
4   B      4      7
5   C      5      9

In [91]:
# Transformation

'''
While aggregation must return a reduced version of the data, 
transformation can return some transformed version of the full data to recombine. 
For such a transformation, the output is the same shape as the input. 
A common example is to center the data by subtracting the group-wise mean
'''
df.groupby('key').transform(lambda x: x - x.mean())

'\nWhile aggregation must return a reduced version of the data, \ntransformation can return some transformed version of the full data to recombine. \nFor such a transformation, the output is the same shape as the input. \nA common example is to center the data by subtracting the group-wise mean\n'

   data1  data2
0   -1.5    1.0
1   -1.5   -3.5
2   -1.5   -3.0
3    1.5   -1.0
4    1.5    3.5
5    1.5    3.0

In [92]:
# Apply

'''
The apply() method lets you apply an arbitrary function to the group results. 
The function should take a DataFrame, and return either a Pandas object (e.g., DataFrame, Series) or a scalar; 
the combine operation will be tailored to the type of output returned.
'''

def norm_by_data2(x):
    # x is a DataFrame of group values
    x['data1'] /= x['data2'].sum()
    return x

df
df.groupby('key').apply(norm_by_data2)

'\nThe apply() method lets you apply an arbitrary function to the group results. \nThe function should take a DataFrame, and return either a Pandas object (e.g., DataFrame, Series) or a scalar; \nthe combine operation will be tailored to the type of output returned.\n'

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

  key     data1  data2
0   A  0.000000      5
1   B  0.142857      0
2   C  0.166667      3
3   A  0.375000      3
4   B  0.571429      7
5   C  0.416667      9